In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df=pd.read_csv("/content/drive/MyDrive/PricingData.csv")

In [ ]:
df.head(10)

              Seat Fare Type 1  ...        RecordedAt
0                900.00,800.00  ...  11-07-2020 16:28
1  910.00,833.00,795.00,762.00  ...  11-07-2020 19:17
2  910.00,833.00,795.00,762.00  ...  12-07-2020 09:02
3  910.00,833.00,795.00,762.00  ...  12-07-2020 10:05
4  876.00,800.00,767.00,729.00  ...  13-07-2020 01:53
5                          600  ...  14-07-2020 06:16
6  876.00,800.00,767.00,729.00  ...  14-07-2020 06:37
7         800.00,767.00,729.00  ...  14-07-2020 06:38
8  876.00,800.00,767.00,729.00  ...  14-07-2020 07:15
9                          729  ...  14-07-2020 08:13

[10 rows x 5 columns]

In [ ]:
s=set()
for i in df["Service Date"].unique():
  s.add(i)
for i in df["RecordedAt"].unique():
  s.add(i)

l=[]
for i in s:
  l.append(i)

l.sort()

time_to_index={}
for i,j in enumerate(l):
  time_to_index[j]=i

In [ ]:
# l

In [ ]:
def transform(s):
  return time_to_index[s]

In [ ]:
df["NEW Service Date"]=df["Service Date"].map(transform)
df["New RecordedAt"]=df["RecordedAt"].map(transform)

In [ ]:
df.head()

              Seat Fare Type 1  ... New RecordedAt
0                900.00,800.00  ...            540
1  910.00,833.00,795.00,762.00  ...            550
2  910.00,833.00,795.00,762.00  ...            578
3  910.00,833.00,795.00,762.00  ...            582
4  876.00,800.00,767.00,729.00  ...            656

[5 rows x 7 columns]

In [ ]:
df["Seat Fare Type 1"]=df["Seat Fare Type 1"].fillna("0.0")
df["Seat Fare Type 2"]=df["Seat Fare Type 2"].fillna("0.0")

In [ ]:
def transform_seat_type(l):
  l=l.split(",")
  ans=0
  for i in l:
    ans=ans+float(i)
  ans=ans/len(l)
  return ans

In [ ]:
df["New Seat Fare Type 1"]=df["Seat Fare Type 1"].map(transform_seat_type)
df["New Seat Fare Type 2"]=df["Seat Fare Type 2"].map(transform_seat_type)

In [ ]:
df["Total Fare"]=(df["New Seat Fare Type 1"]+df["New Seat Fare Type 2"])/2

In [ ]:
df.head()

              Seat Fare Type 1  ... Total Fare
0                900.00,800.00  ...      425.0
1  910.00,833.00,795.00,762.00  ...      412.5
2  910.00,833.00,795.00,762.00  ...      412.5
3  910.00,833.00,795.00,762.00  ...      412.5
4  876.00,800.00,767.00,729.00  ...      396.5

[5 rows x 10 columns]

In [ ]:
bus_to_index={}
l=[]
for i in df.Bus.unique():
  l.append(i)
for i,j in enumerate(l):
  bus_to_index[j]=i

In [ ]:
def transform_bus(s):
  return bus_to_index[s]

In [ ]:
df["BUSSES"]=df["Bus"].map(transform_bus)

In [ ]:
df.head()

              Seat Fare Type 1 Seat Fare Type 2  ... Total Fare BUSSES
0                900.00,800.00              0.0  ...      425.0      0
1  910.00,833.00,795.00,762.00              0.0  ...      412.5      0
2  910.00,833.00,795.00,762.00              0.0  ...      412.5      0
3  910.00,833.00,795.00,762.00              0.0  ...      412.5      0
4  876.00,800.00,767.00,729.00              0.0  ...      396.5      0

[5 rows x 11 columns]

In [ ]:
df_new=df[["BUSSES","Total Fare","NEW Service Date","New RecordedAt"]]

In [ ]:
df_new.head()

   BUSSES  Total Fare  NEW Service Date  New RecordedAt
0       0       425.0              1250             540
1       0       412.5              1250             550
2       0       412.5              1250             578
3       0       412.5              1250             582
4       0       396.5              1250             656

In [ ]:
bus_min=min(df_new["BUSSES"])
bus_max=max(df_new["BUSSES"])

TF_min=min(df_new["Total Fare"])
TF_max=max(df_new["Total Fare"])

NSD_min=min(df_new["NEW Service Date"])
NSD_max=max(df_new["NEW Service Date"])

NRA_min=min(df_new["New RecordedAt"])
NRA_max=max(df_new["New RecordedAt"])

date_min=min(NSD_min,NRA_min)
date_max=max(NSD_max,NRA_max)

In [ ]:
df_new["BUSSES"]=(df_new["BUSSES"]-bus_min)/(bus_max-bus_min)

df_new["Total Fare"]=(df_new["Total Fare"]-TF_min)/(TF_max-TF_min)

df_new["NEW Service Date"]=(df_new["NEW Service Date"]-date_min)/(date_max-date_min)

df_new["New RecordedAt"]=(df_new["New RecordedAt"]-date_min)/(date_max-date_min)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """
/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys

In [ ]:
df_new.head()

   BUSSES  Total Fare  NEW Service Date  New RecordedAt
0     0.0    0.586611          0.102375        0.044226
1     0.0    0.569358          0.102375        0.045045
2     0.0    0.569358          0.102375        0.047338
3     0.0    0.569358          0.102375        0.047666
4     0.0    0.547274          0.102375        0.053726

In [ ]:
from sklearn.cluster import KMeans
kmeans=KMeans(n_clusters=2)

In [ ]:
kmeans.fit(df_new)

KMeans(n_clusters=2)

In [ ]:
kmeans.cluster_centers_

array([[0.35883266, 0.43124965, 0.32190009, 0.27629387],
       [0.46838508, 0.38958298, 0.76015379, 0.74510275]])

In [ ]:
df_new["CLASS"]=kmeans.predict(df_new)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [ ]:
df_new.head()

   BUSSES  Total Fare  NEW Service Date  New RecordedAt  CLASS
0     0.0    0.586611          0.102375        0.044226      0
1     0.0    0.569358          0.102375        0.045045      0
2     0.0    0.569358          0.102375        0.047338      0
3     0.0    0.569358          0.102375        0.047666      0
4     0.0    0.547274          0.102375        0.053726      0

In [ ]:
df_new.describe()

             BUSSES    Total Fare  ...  New RecordedAt         CLASS
count  30649.000000  30649.000000  ...    30649.000000  30649.000000
mean       0.416284      0.409399  ...        0.522147      0.524715
std        0.245279      0.199997  ...        0.282027      0.499397
min        0.000000      0.000000  ...        0.000000      0.000000
25%        0.215517      0.345066  ...        0.279197      0.000000
50%        0.405172      0.448585  ...        0.534562      1.000000
75%        0.551724      0.542443  ...        0.753399      1.000000
max        1.000000      1.000000  ...        1.000000      1.000000

[8 rows x 5 columns]

In [ ]:
# df_g=df_new.groupby("BUSSES")

In [ ]:
# bus_score={}
# for bus,bus_df in df_g:
#   bus_score[bus]=np.mean(bus_df.CLASS)
#   if bus_score[bus]>0.5:
#     bus_score[bus]=1
#   else:
#     bus_score[bus]=0

In [ ]:
df_temp=df_new.groupby("NEW Service Date")
zero=0
one=0
for s,s_df in df_temp:
  min_date=np.min(s_df["New RecordedAt"])
  temp_df=s_df.loc[s_df["New RecordedAt"]==min_date]
  if np.mean(temp_df.CLASS)>=0.5:
    one=one+1;
  else:
    zero=zero+1
print(zero,one)

16 0

In [ ]:
#zero is independent while one is follower

In [ ]:
df_g=df_new.groupby("BUSSES")
bus_score={}
for bus,bus_df in df_g:
  bus_score[bus]=np.mean(bus_df.CLASS)
  # if bus_score[bus]>0.5:
  #   bus_score[bus]=1
  # else:
  #   bus_score[bus]=0

In [ ]:
# bus_score

In [ ]:
bus_score_follows={}
for k in bus_score:
  bus_score_follows[k]=1-bus_score[k]

In [ ]:
df_new.head()

   BUSSES  Total Fare  NEW Service Date  New RecordedAt  CLASS
0     0.0    0.586611          0.102375        0.044226      0
1     0.0    0.569358          0.102375        0.045045      0
2     0.0    0.569358          0.102375        0.047338      0
3     0.0    0.569358          0.102375        0.047666      0
4     0.0    0.547274          0.102375        0.053726      0

In [ ]:
def trans(s):
  if bus_score[s]>=0.5:
    return 1
  else:
    return 0

In [ ]:
df_new["CLASS"]=df_new["BUSSES"].map(trans)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [ ]:
df_new.head()

   BUSSES  Total Fare  NEW Service Date  New RecordedAt  CLASS
0     0.0    0.586611          0.102375        0.044226      0
1     0.0    0.569358          0.102375        0.045045      0
2     0.0    0.569358          0.102375        0.047338      0
3     0.0    0.569358          0.102375        0.047666      0
4     0.0    0.547274          0.102375        0.053726      0

In [ ]:
bus_follows={}
bus_followed_by={}
for